app/views/articles/index.html.erb


        <% if current_user.email == article.user.email or current_user.friends.include? article.user or current_user.followed.include? article.user %>
---
SELECT "users".* FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = $1  [["user_id", 2]]

      <h4>Friend List</h4>
      <% current_user.friendships.each do |friendship| %>
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 2]]