app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC
---
  def index
    @articles = Article.all

INSERT INTO "articles" ("body", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "1123213"], ["created_at", Fri, 07 Oct 2016 18:51:16 UTC +00:00], ["title", "123"], ["updated_at", Fri, 07 Oct 2016 18:51:16 UTC +00:00], ["user_id", 1]]
---
  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "picture" = $1, "updated_at" = $2 WHERE "articles"."id" = 7  [["picture", "_Ahriman_01__Ahriman__Exile_-_John_French.jpg"], ["updated_at", Sat, 08 Oct 2016 22:06:52 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)