app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["article_id", 2], ["body", "dasdadad"], ["commenter", "asda"], ["created_at", Sun, 02 Oct 2016 04:52:34 UTC +00:00], ["updated_at", Sun, 02 Oct 2016 04:52:34 UTC +00:00]]
---
  def create

    @article = Article.find(params[:article_id])
    @comment = Comment.new(comment_params)
    @comment.article = @article
    @comment.user = current_user

    if @comment.save