app/controllers/friendships_controller.rb

  def index
    @users = (current_user.blank? ? User.all : User.find(:all, :conditions => ["id != ?", current_user.id]))
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY "users"."id" ASC LIMIT 1

  def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    if @friendship.save
---
INSERT INTO "friendships" ("created_at", "friend_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 08 Oct 2016 05:59:49 UTC +00:00], ["friend_id", 1], ["updated_at", Sat, 08 Oct 2016 05:59:49 UTC +00:00], ["user_id", 3]]